УчетВУправляющихДляГит1/src/DataProcessors/УПЖКХ_ИнтеграцияССайтом/УПЖКХ_ИнтеграцияССайтом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УПЖКХ_ИнтеграцияССайтом</name>
  <attributes>
    <name>НастройкаДоступа</name>
    <type>
      <types>CatalogRef.УПЖКХ_НастройкиДоступаКСайту</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаОбмена</name>
    <type>
      <types>CatalogRef.УПЖКХ_НастройкиОбменаДаннымиССайтомЖКХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьПараметрыДоступа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

УчетВУправляющихДляГит1/src/DataProcessors/УПЖКХ_ИнтеграцияССайтом/ObjectModule.bsl
#Область ИнициализацияРеквизитов

// Восстанавливает настройки пользователя.
//
Процедура ИнициализацияРеквизитов() Экспорт
	
	СтруктураНастроек = ХранилищеОбщихНастроек.Загрузить("Обработка.УПЖКХ_ИнтеграцияССайтом");
	
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		СтруктураНастроек.Свойство("НастройкаДоступа",          НастройкаДоступа);
		СтруктураНастроек.Свойство("НастройкаОбмена",           НастройкаОбмена);
		СтруктураНастроек.Свойство("ОбновлятьПараметрыДоступа", ОбновлятьПараметрыДоступа);
	КонецЕсли;
	
КонецПроцедуры // ИнициализацияРеквизитов()

#КонецОбласти
